/* FTP error code message */
"\n\nFTP error code: %@" = "\n\nCódigo de erro do FTP: %@";

/* Error with FTP access to server */
"Access to the FTP server denied.  Please check your credentials." = "Acesso negado ao servidor FTP.  Verifique suas credenciais.";

/* test connection failed */
"Connection Failed" = "Falha na conexão";

/* test connection worked */
"Connection Successful" = "Conexão bem-sucedida";

/* error message shown in properties dialog status when testing connections */
"Connection failed. Please verify your settings." = "Falha na conexão. Verifique suas configurações.";

/* error message shown in properties dialog status when testing connections */
"Directory does not exist." = "O diretório não existe.";

/* Error with FTP server not initialized */
"Error initializing Server" = "Erro na inicialização do servidor";

/* Inform user that there was an error with FTP and we don't know what it is */
"Error uploading with FTP" = "Erro no carregamento com FTP";

/* Error with FTP writing data */
"Error while writing data." = "Erro na gravação de dados.";

/* plugin name */
"FTP" = "FTP";

/* General Error with FTP */
"Failed to write file. Server returned an error, which could be caused by invalid credentials or an invalid directory.  Make sure you aren't creating nested directories." = "Falha ao gravar o arquivo. O servidor retornou um erro, que pode ter sido causado por credenciais inválidas ou diretório inválido. Certifique-se de não criar diretórios aninhados.";

/* Error with FTP password */
"Please enter a password. Go to Preferences > Share > FTP to configure." = "Insira uma senha. Vá para Preferências > Compartilhamento > FTP para configurar.";

/* Error with FTP username */
"Please enter a username. Go to Preferences > Share > FTP to configure." = "Insira um nome de usuário. Vá para Preferências > Compartilhamento > FTP para configurar.";

/* Error with FTP destination */
"Please enter a valid destination. Go to Preferences > Share > FTP to configure." = "Insira um destino válido. Vá para Preferências > Compartilhamento > FTP para configurar.";

/* plugin button tooltip */
"Send the capture to an FTP server using file transfer protocol." = "Envie a captura para um servidor FTP usando o protocolo de transferência de arquivo.";

/* Error with FTP port */
"Server port invalid. Go to Preferences > Share > FTP to configure." = "Porta de servidor inválida. Vá para Preferências > Compartilhamento > FTP para configurar.";

/* Name of the service that gets stored in the password manager */
"TechSmith FTP Output" = "Saída do FTP da TechSmith";

/* Error with FTP destination not reachable */
"The FTP destination could not be reached." = "O destino do FTP não pôde ser acessado.";

/* Error with FTP write stream */
"There was an error creating the write stream." = "Ocorreu um erro na criação do fluxo de gravação.";

/* Error with FTP reading file */
"There was an error reading the file." = "Ocorreu um erro na leitura do arquivo.";

/* Inform user that upload worked */
"Upload Successful" = "Upload bem-sucedido";

/* Inform user that capture failed and wasn't shared */
"Your capture was not shared." = "A sua captura não foi compartilhada.";

/* No comment provided by engineer. */
"[date]" = "[data]";

/* No comment provided by engineer. */
"[filehash]" = "[hash de arquivo]";

/* No comment provided by engineer. */
"[filename]" = "[nome do arquivo]";

